results/ryzen9-7950x-node0/arena-v3/e2e/h2-arena-1-load.txt
starting benchmark...
spawning thread #0: 4 total client(s). 500000 total requests
spawning thread #1: 4 total client(s). 500000 total requests
spawning thread #2: 4 total client(s). 500000 total requests
spawning thread #3: 4 total client(s). 500000 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 5.18s, 385920.31 req/s, 1.30GB/s
requests: 2000000 total, 2000000 started, 2000000 done, 2000000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 6.75GB (7243949132) total, 1.91MB (2000000) headers (space savings 90.00%), 6.68GB (7168315520) data
                     min         max         mean         sd        +/- sd
time for request:      305us      7.76ms      1.18ms       198us    98.76%
time for connect:       69us       454us       229us       129us    50.00%
time to 1st byte:     4.26ms      6.36ms      5.15ms       825us    62.50%
req/s           :   24120.89    24660.51    24366.20      183.19    50.00%