results/ryzen9-7950x-node0/arena-v3/e2e/h2-arena-3-load.txt
starting benchmark...
spawning thread #0: 4 total client(s). 500000 total requests
spawning thread #1: 4 total client(s). 500000 total requests
spawning thread #2: 4 total client(s). 500000 total requests
spawning thread #3: 4 total client(s). 500000 total requests
Application protocol: h2c
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 5.11s, 391596.65 req/s, 1.32GB/s
requests: 2000000 total, 2000000 started, 2000000 done, 2000000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 6.75GB (7244244188) total, 1.91MB (2000000) headers (space savings 90.00%), 6.68GB (7168315520) data
                     min         max         mean         sd        +/- sd
time for request:      283us     10.45ms      1.17ms       217us    98.56%
time for connect:       70us       404us       215us       124us    50.00%
time to 1st byte:     4.56ms      8.80ms      5.77ms      1.34ms    81.25%
req/s           :   24476.26    24665.37    24569.95       61.99    50.00%